Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>Yc/5vl2ixmX3iH7TDmn7/x8QFlRi/gdgcegizRNZ99YXuNSko4AKrjGVQjkouDTr6iVdoleW73O/&#13;
za5mIl72g6M0EmxZy2/IeGStWFaXLXXEG387ONglgUQUJ/JTM2PWihzFttavwOeALlsLXVdqI9LY&#13;
WUWa14aMWHgOOQaSLR2OzmPZwNfDWsfAcvr6aLrWNv8tEl/ifNrEd/DWUaaxOoD6+Zd0vBGpgMPP&#13;
63dSzAXug9Ws3vfp9HssLrBvDVaFlvrgy+uJAeW4n2Nl9C1O2+qp2W4cjNxlhAd6dyV4Cxhn6rZg&#13;
ry9qPrNVilhPxYzgKSU+eCFtTwbwQUH8SkHkKw==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>nk6uioaqICC+AJmHEBytXUz3OrgNSYJj1iowDlKIoGjE/lp+3Nwka2KrHJdzNnQA7NOtstdtFQWp&#13;
DqOU+RKMsZaq5GGiOJ5dEIBkf0XDRJVjztA36cJn52AtorVneB+Z46Ov10xIvCWJ8MsuLpuWXUQ7&#13;
oWCF++fomO7ibnFTEm7RST4ZdhqvHpMCVZg0za4ZIjlf/pr7WKMLApXSfap/oxtwGuivZ+KeZjYr&#13;
/IOm3Fy0SGOdW9QWfAV8f57oQgynfDroM5b1Q0bAj2GDtDKacg5xOGq+I/QHqwvwU5UF0w0Iw1Le&#13;
I5CsZep3n11oQDvLDE0L/urH3QocRO40fSd9EMeqaOIVP2bVf09mL6VtXZSeTa2lQODVg7s4lSDW&#13;
HOASfPmIl0Qydk2sb7msJ0KRNdNlfObCkS87iF6xjRWMx/iInzxsJUsEv2BfRajFLQjx0UkCUx4J&#13;
iQ4EzgkVBtoWqFOosk9Scpm99mPBfjEGuw2uHVgTHHuFyX2FctdoqZhPtdpbJZUo2iVJjcN9BWll&#13;
5zWf6Ywj0vCqoIE54fa/FWf4QvzQ2RfbU7k+W2DLak/V+xY1KxHWzCvHqVtdHegA2GTlp2QnuXkl&#13;
qqcQEUGM1sz9MasNVrn7dA+sBkUU27yWzz7uS29F8Gf8w7mSg7KIn96G3aw2TjlAaye7kqv6ZRt3&#13;
IQIrV0dsgOp2QyUfKaaYGj0rKas0MxJEf89hPn3ZZIXTviDyeg9EypyYFT+uHfQyxSJpKAE789iA&#13;
YAKf4OQdEn7jPjR7vALuPeRBU5hDvYGgousvGJM9kDyRSEjEoDRcsxe1OiBBgHBwNFO5vIX/bOnA&#13;
AZ+b+iMYF864l/ToucMmv3UePOW7/a28cbYN6dzhKAWgsbPGyBZHD4RwfDQfWiE1NgQR470geCom&#13;
jsEtZaQ9fzUBF/1YYkOkMGhPgYClAzvVoAcYSgps01X9SgU35ML8uY4LFq6SttKpRWwVwyYf9X4Z&#13;
hW1w</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>Y65dRLouTIIFacZ0MWVErEHY7Jo=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
Kpj4EbxJ4JsFmJyRjwEUWHuOJeh+mnR/MaCwufRz9ygw4iwDAaSoP60g7qVRmgOaaaQF+o1FOQg6&#13;
gZH2Sd4uotFO5kn4bB/cGVH2q+SaD5/ih59WExcPGo1mDEqO2oCTkU0oCzJpPWSmzEmoO9UPXCoM&#13;
WyXkKlN7Bn/Atr6R7XZI9Xf6uannd37TqmB3+pC7lYNaWeGyTN1asYztCaKblN/HcgO6ty2D6jLy&#13;
L8g0VE1GwkzqDv57wxhKCd3PW6hDs1k6D/V0FGPEk9OIT3Y0ARtMPq3rUc9pJwaruq4bCCLjjcYt&#13;
Imx+wX4z2eL54sOGvpO0sxb6eHB7SRXkA1JHmQ==
</ds:SignatureValue>
<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>